# описать один образ который подключаю и его настройки
FROM образ:версия или latest (без ":" - latest) (то есть если нужен образ питон языка, то укажем его)
COPY какие файлы из нашего проекта будет копировать в image) "." - все файлы оттуда, где Dockerfile + указываем в какую
директорию нашего image мы будем помещать все эти файлы ("." - в корень)
WORKDIR (рабочая директория) (н-р: /pd_1)
EXPOSE (порт внутри докера)
RUN (выполнить 1 раз какое-то действией при превоначальном запуске контейнера) н-р основной файл нашего кода main.py
CMD (выполняется каждый раз когда запускается контейнер) н-р: ["py", "main"] (если бы запускат в терминале то было бы 'py main.py')
# docker build путь_к_докерфайлу (н-р: docker build .)
# docker image rm id_образа_чтобы_удалить - удаление

порядок всех этих команд неважен
далее docker run -p порт_на_локальном_хосте:порт_в_контейнере id_контейнера